wisteria-1c/Конфигурация/InformationRegisters/СопоставлениеНоменклатурыОФД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СопоставлениеНоменклатурыОФД</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

wisteria-1c/Конфигурация/InformationRegisters/СопоставлениеНоменклатурыОФД/Forms/ФормаСопоставленияТоваров/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	СопоставлениеПослеЗагрузки = Параметры.СопоставлениеПослеЗагрузки;
	
	Если СопоставлениеПослеЗагрузки Тогда
		
		НесопоставленныеТовары = Параметры.НесопоставленныеТоварыОФД;
		
		Для Каждого Товар Из НесопоставленныеТовары Цикл
			НовыйТовар = СписокТоваровОФД.Добавить();
			НовыйТовар.ТоварОФД = Товар.Ключ;
			НовыйТовар.ПризнакПредметаРасчета = Товар.Значение.ПризнакПредметаРасчета;
			НовыйТовар.Штрихкод = Товар.Значение.Штрихкод;
			НовыйТовар.НоменклатураСопоставлена = Ложь;
		КонецЦикла;
		
		Элементы.ПродолжитьЗагрузку.Доступность = Ложь;
		
	Иначе
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	СопоставлениеНоменклатурыОФД.Наименование КАК Наименование,
		|	СопоставлениеНоменклатурыОФД.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ТаблицаСопоставленнойНоменклатуры
		|ИЗ
		|	РегистрСведений.СопоставлениеНоменклатурыОФД КАК СопоставлениеНоменклатурыОФД
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаСопоставленнойНоменклатуры.Номенклатура.Штрихкод КАК Штрихкод,
		|	ТаблицаСопоставленнойНоменклатуры.Номенклатура.ПризнакПредметаРасчета КАК ПризнакПредметаРасчета,
		|	ТаблицаСопоставленнойНоменклатуры.Наименование КАК Наименование
		|ИЗ
		|	ТаблицаСопоставленнойНоменклатуры КАК ТаблицаСопоставленнойНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСопоставления
		|		ПО ТаблицаСопоставленнойНоменклатуры.Номенклатура = НоменклатураСопоставления.Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование");
		
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаИзРезультатаЗапроса = РезультатЗАпроса.Выбрать(); 
		
		Пока ВыборкаИзРезультатаЗапроса.Следующий() Цикл
			
			НовыйТовар = СписокТоваровОФД.Добавить();
			НовыйТовар.ТоварОФД = ВыборкаИзРезультатаЗапроса.Наименование;
			НовыйТовар.ПризнакПредметаРасчета = ВыборкаИзРезультатаЗапроса.ПризнакПредметаРасчета;
			НовыйТовар.Штрихкод = ВыборкаИзРезультатаЗапроса.Штрихкод;
			НовыйТовар.НоменклатураСопоставлена = Истина;
			
		КонецЦикла;
		
		Элементы.СоздатьНоменклатуру.Видимость = Ложь;
		Элементы.ПродолжитьЗагрузку.Видимость  = Ложь;
		
	КонецЕсли;
	
	ЭтоИнтерфейсТакси = Не ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();
	ЭтоМобильныйКлиент = ОбщегоНазначения.ЭтоМобильныйКлиент();
	
	АдаптацияФормыТакси();
	АдаптацияФормыМК();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_Номенклатура" Тогда
		
		СтрокиДляОбработкиСпискаТоваровОФД = Элементы.СписокТоваровОФД.ПолучитьСтрокиДляОбработки();
		Если СтрокиДляОбработкиСпискаТоваровОФД.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
		МассивТоваровОФД = Новый Массив;
		
		Для каждого ТоварОФД Из СтрокиДляОбработкиСпискаТоваровОФД Цикл
			
			ДанныеТовара = Элементы.СписокТоваровОФД.ДанныеСтроки(ТоварОФД);
			СтруктураТовара = Новый Структура;
			СтруктураТовара.Вставить("ТоварОФД",    ДанныеТовара.ТоварОФД);
			СтруктураТовара.Вставить("НомерСтроки", ТоварОФД);
			МассивТоваровОФД.Добавить(СтруктураТовара);
			
		КонецЦикла;
		
		НоменклатураДляЗаписи = Новый Структура;
		НоменклатураДляЗаписи.Вставить("Номенклатура", Параметр);
		НоменклатураДляЗаписи.Вставить("Характеристика", Неопределено);
		
		ВыполнитьСопоставлениеТоваров(МассивТоваровОФД, НоменклатураДляЗаписи); 
		
		Элементы.СписокТоваровОФД.Обновить();
		Элементы.СписокНоменклатуры.Обновить();
		
		ОтборТоваровОФД = Новый Структура();
		ОтборТоваровОФД.Вставить("НоменклатураСопоставлена", Ложь);
		
		НесопоставленныеСтроки = СписокТоваровОФД.НайтиСтроки(ОтборТоваровОФД); 
		
		Если НесопоставленныеСтроки.Количество() = 0 Тогда
			Элементы.ПродолжитьЗагрузку.Доступность = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если НЕ ЭтоМобильныйКлиент Тогда
		Возврат;
	КонецЕсли;
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаТоварыОФД Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	Отказ = Истина;
	ПереключитьСтраницу(Истина);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокТоваровОФД

&НаКлиенте
Процедура СписокТоваровОФДПриАктивизацииСтроки(Элемент)
	
	Если СписокТоваровОФД.Количество() = 0
		ИЛИ Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("Подключаемый_ОбновитьНастройкиСпискаНоменклатуры", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровОФДВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если НЕ ЭтоМобильныйКлиент Тогда
		Возврат;
	КонецЕсли;
	
	Если СписокТоваровОФД.Количество() = 0
		ИЛИ Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПереключитьСтраницу(Ложь, Элемент.ТекущиеДанные.НоменклатураСопоставлена);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокНоменклатуры

&НаКлиенте
Процедура СписокНоменклатурыПриАктивизацииСтроки(Элемент)
	
	Если НЕ ЭтоМобильныйКлиент Тогда
		Возврат;
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("Подключаемый_ОбновитьСвойствоЭлементаФормыСопоставитьМобильныйКлиент",
		0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	Если НЕ ЭтоМобильныйКлиент Тогда
		Возврат;
	КонецЕсли;
	
	Если Элементы.СопоставитьМобильныйКлиент.Видимость Тогда
		СтандартнаяОбработка = Ложь;
		СопоставитьТовары();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сопоставить(Команда)
	Если НЕ ЭтоМобильныйКлиент Тогда
		СопоставитьТовары();
	Иначе
		ПереключитьСтраницу(Ложь, Ложь);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СопоставитьСписокНоменклатуры(Команда)
	СопоставитьТовары();
	Если ЭтоМобильныйКлиент Тогда
		ПереключитьСтраницу(Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СопоставитьМобильныйКлиент(Команда)
	
	Если Элементы.СписокНоменклатуры.ТекущиеДанные = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СопоставитьМобильныйКлиент",
			"Доступность", Ложь);
		Возврат;
	КонецЕсли;
	
	СопоставитьТовары();
	ПереключитьСтраницу(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНоменклатуру(Команда)
	
	РодительЗначение = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
	
	ЗначенияЗаполнения = Новый Структура("Родитель", РодительЗначение);
	ЗначенияЗаполнения.Вставить("ЭтоНабор", Ложь); 
	ЗначенияЗаполнения.Вставить("ПризнакПредметаРасчета", Элементы.СписокТоваровОФД.ТекущиеДанные.ПризнакПредметаРасчета);
	ЗначенияЗаполнения.Вставить("Наименование", Элементы.СписокТоваровОФД.ТекущиеДанные.ТоварОФД);
	ЗначенияЗаполнения.Вставить("НаименованиеПолное", Элементы.СписокТоваровОФД.ТекущиеДанные.ТоварОФД);
	
	СтруктураПараметров = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	СоздатьНоменклатуруЗавершение = Новый ОписаниеОповещения("СоздатьНоменклатуруЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("Справочник.Номенклатура.ФормаОбъекта", СтруктураПараметров, ЭтаФорма,,,,);
	
КонецПроцедуры 

&НаКлиенте
Процедура Рассопоставить(Команда)
	
	МассивЭлементов = Новый Массив;
	Для каждого ТоварОФД Из Элементы.СписокТоваровОФД.ПолучитьСтрокиДляОбработки() Цикл
		
		ДанныеСтроки = Элементы.СписокТоваровОФД.ДанныеСтроки(ТоварОФД);
		Если ДанныеСтроки.НоменклатураСопоставлена Тогда
			МассивЭлементов.Добавить(ДанныеСтроки.ТоварОФД);
		КонецЕсли;
		
	КонецЦикла;
	
	Если МассивЭлементов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	РасспопоставитьНаСервере(МассивЭлементов);
	
	Элементы.СписокТоваровОФД.Обновить();
	Элементы.СписокНоменклатуры.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьЗагрузку(Команда)
	
	ПараметрыЗакрытия = Новый Структура();
	ПараметрыЗакрытия.Вставить("СопоставлениеВыполнено", Истина);
	
	Закрыть(ПараметрыЗакрытия);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СопоставитьТовары()
	
	СтрокиДляОбработкиСпискаНоменклатуры = Элементы.СписокНоменклатуры.ПолучитьСтрокиДляОбработки();
	СтрокиДляОбработкиСпискаТоваровОФД = Элементы.СписокТоваровОФД.ПолучитьСтрокиДляОбработки();
	Если СтрокиДляОбработкиСпискаНоменклатуры.Количество() = 0
		ИЛИ СтрокиДляОбработкиСпискаТоваровОФД.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МассивТоваровОФД = Новый Массив;
	
	Для каждого ТоварОФД Из СтрокиДляОбработкиСпискаТоваровОФД Цикл
		
		ДанныеТовара = Элементы.СписокТоваровОФД.ДанныеСтроки(ТоварОФД);
		СтруктураТовара = Новый Структура;
		СтруктураТовара.Вставить("ТоварОФД",    ДанныеТовара.ТоварОФД);
		СтруктураТовара.Вставить("НомерСтроки", ТоварОФД);
		МассивТоваровОФД.Добавить(СтруктураТовара);
		
	КонецЦикла;
	СтрокаНоменклатуры = СтрокиДляОбработкиСпискаНоменклатуры[0];
	ДанныеНоменклатуры = Элементы.СписокНоменклатуры.ДанныеСтроки(СтрокаНоменклатуры);
	НоменклатураДляЗаписи = Новый Структура;
	НоменклатураДляЗаписи.Вставить("Номенклатура");
	НоменклатураДляЗаписи.Вставить("Характеристика");
	ЗаполнитьЗначенияСвойств(НоменклатураДляЗаписи, ДанныеНоменклатуры);
	
	ВыполнитьСопоставлениеТоваров(МассивТоваровОФД, НоменклатураДляЗаписи);
	
	Элементы.СписокТоваровОФД.Обновить();
	Элементы.СписокНоменклатуры.Обновить();
	
	ОтборТоваровОФД = Новый Структура();
	ОтборТоваровОФД.Вставить("НоменклатураСопоставлена", Ложь);
	
	НесопоставленныеСтроки = СписокТоваровОФД.НайтиСтроки(ОтборТоваровОФД);
	
	Если НесопоставленныеСтроки.Количество() = 0 Тогда
		Элементы.ПродолжитьЗагрузку.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьСопоставлениеТоваров(МассивТоваровОФД, НоменклатураДляЗаписи)
	
	Для Каждого СтрокаТовара Из МассивТоваровОФД Цикл
		
		Запись = РегистрыСведений.СопоставлениеНоменклатурыОФД.СоздатьМенеджерЗаписи();
		Запись.Наименование   = СтрокаТовара.ТоварОФД;
		Запись.Номенклатура   = НоменклатураДляЗаписи.Номенклатура;
		Запись.Характеристика = НоменклатураДляЗаписи.Характеристика;
		Запись.Записать();
		
		СтрокаНоменклатуры = СписокТоваровОФД.Получить(СтрокаТовара.НомерСтроки);
		СтрокаНоменклатуры.НоменклатураСопоставлена = Истина;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНоменклатуруЗавершение() Экспорт
	
	Элементы.СписокТоваровОФД.Обновить();
	Элементы.СписокНоменклатуры.Обновить();
	
	Элементы.СписокНоменклатуры.ПолучитьСтрокиДляОбработки().Очистить();
	
КонецПроцедуры

&НаСервере
Процедура РасспопоставитьНаСервере(МассивТоваровОФД)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТоварыОФД", МассивТоваровОФД);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СопоставлениеНоменклатурыОФД.Наименование КАК Наименование,
	|	СопоставлениеНоменклатурыОФД.Номенклатура КАК Номенклатура,
	|	СопоставлениеНоменклатурыОФД.Характеристика КАК Характеристика
	|ИЗ
	|	РегистрСведений.СопоставлениеНоменклатурыОФД КАК СопоставлениеНоменклатурыОФД
	|ГДЕ
	|	СопоставлениеНоменклатурыОФД.Наименование В(&ТоварыОФД)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Запись = РегистрыСведений.СопоставлениеНоменклатурыОФД.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		Запись.Прочитать(); 
		
		ОтборСтрок = Новый Структура;
		ОтборСтрок.Вставить("ТоварОФД", Выборка.Наименование);
		СтрокиТоваровОФД = СписокТоваровОФД.НайтиСтроки(ОтборСтрок);
		ТоварОФД = СтрокиТоваровОФД[0];
		ТоварОФД.НоменклатураСопоставлена = Ложь;
		
		Если Запись.Выбран() Тогда
			Запись.Удалить(); 
			Элементы.ПродолжитьЗагрузку.Доступность = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура АдаптацияФормыТакси()
	
	Если НЕ ЭтоИнтерфейсТакси Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокНоменклатурыСопоставить",
		"Видимость", Ложь);
	Элементы.Переместить(Элементы.ФормаГруппаИзменитьФормуСправка, Элементы.СписокНоменклатуры.КоманднаяПанель);
	
КонецПроцедуры

&НаСервере
Процедура АдаптацияФормыМК()
	
	Если НЕ ЭтоМобильныйКлиент Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаСтраницы",
		"Видимость", Истина);
	Элементы.Переместить(Элементы.ГруппаТоварыОФД, Элементы.СтраницаТоварыОФД);
	Элементы.Переместить(Элементы.ГруппаНоменклатура, Элементы.СтраницаСписокНоменклатуры);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"СписокНоменклатурыСопоставленаСВыбраннымТоваромОФД",
		"ПоложениеЗаголовка", ПоложениеЗаголовкаЭлементаФормы.Авто);
	
	Если НЕ ЭтоИнтерфейсТакси Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокНоменклатурыОбновить",
			"ПоложениеВКоманднойПанели", ПоложениеКнопкиВКоманднойПанели.ВДополнительномПодменю);
	КонецЕсли;
	
	Элементы.СписокНоменклатуры.РежимВыбора = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПереключитьСтраницу(ГлавнаяСтраница = Истина, НоменклатураСопоставлена = Истина)
	
	ИмяСвойстваВидимость = "Видимость";
	Если ГлавнаяСтраница Тогда
		Заголовок = НСтр("ru = 'Сопоставление товаров ОФД'");
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаТоварыОФД;
	Иначе
		Заголовок = НСтр("ru = 'Назад к списку товаров ОФД'");
		
		ЗаголовокДекорацииНоменклатура = НСтр("ru = 'Номенклатура для ""%1""'");
		Элементы.ГруппаНоменклатура.Заголовок = СтрШаблон(ЗаголовокДекорацииНоменклатура,
			Элементы.СписокТоваровОФД.ТекущиеДанные.ТоварОФД);
			
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаСписокНоменклатуры;
		ИзменитьРежимВыбораСпискаНоменклатуры(НоменклатураСопоставлена);
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокНоменклатурыОбновить",
			"ПоложениеВКоманднойПанели", ПоложениеКнопкиВКоманднойПанели.ВДополнительномПодменю);
		Если НЕ ЭтоИнтерфейсТакси И НЕ НоменклатураСопоставлена Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокНоменклатурыВыбрать",
				"ПоложениеВКоманднойПанели", ПоложениеКнопкиВКоманднойПанели.ВДополнительномПодменю);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокНоменклатурыРедактироватьСписок",
				ИмяСвойстваВидимость, Ложь);
		КонецЕсли;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СопоставитьМобильныйКлиент",
		ИмяСвойстваВидимость, НЕ ГлавнаяСтраница И НЕ НоменклатураСопоставлена);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПродолжитьЗагрузку",
		ИмяСвойстваВидимость, ГлавнаяСтраница И СопоставлениеПослеЗагрузки);
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьРежимВыбораСпискаНоменклатуры(Знач НоменклатураСопоставлена)
	Элементы.СписокНоменклатуры.РежимВыбора = НЕ НоменклатураСопоставлена;
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьНастройкиСпискаНоменклатуры()
	
	ТекущиеДанные = Элементы.СписокТоваровОФД.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КоллекцияЭлементов = СписокНоменклатуры.КомпоновщикНастроек.Настройки.Отбор.Элементы;
	
	ПолеКомпоновки = Новый ПолеКомпоновкиДанных("ПризнакПредметаРасчета");
	Для Каждого ЭлементОтбора Из КоллекцияЭлементов Цикл
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных")
			И ЭлементОтбора.ЛевоеЗначение = ПолеКомпоновки Тогда
			КоллекцияЭлементов.Удалить(ЭлементОтбора);
		КонецЕсли;
	КонецЦикла;
	
	ЭлементОтбора = КоллекцияЭлементов.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("ПризнакПредметаРасчета");
	ЭлементОтбора.ВидСравнения     = ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбора.Использование    = Истина;
	СписокОтбора = Новый СписокЗначений;
	СписокОтбора.Добавить(ТекущиеДанные.ПризнакПредметаРасчета);
	СписокОтбора.Добавить(ПредопределенноеЗначение("Перечисление.ПризнакиПредметаРасчета.ПустаяСсылка"));
	ЭлементОтбора.ПравоеЗначение   = СписокОтбора;
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокНоменклатуры,
		"ТоварОФД", ТекущиеДанные.ТоварОФД);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьСвойствоЭлементаФормыСопоставитьМобильныйКлиент()
	
	ТекущиеДанные = Элементы.СписокНоменклатуры.ТекущиеДанные;
	Если Элементы.СопоставитьМобильныйКлиент.Видимость Тогда
		НоменклатураВыбрана = ТекущиеДанные <> Неопределено;
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СопоставитьМобильныйКлиент",
			"Доступность", НоменклатураВыбрана);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
